---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarTrimExtendData
source: html/a751c2cd-dd05-fba8-db8c-f9740cebcbea.htm
---
# RebarTrimExtendData Properties

Specifies whether the .NET object represents a valid Revit entity.